{
    "description": "A student majoring in informatics engineering at Batam State Polytechnic with one year internship experience as a full-stack web developer at a course institution that makes him capable of front-end and back-end web development. Expert in HTML, CSS, Tailwind CSS, DaisyUI, Javascript, ReactJS, ExpressJS, Dart, Flutter C#, PHP, Mudblazor and Java, he also has strong analytical and leadership skills. A good fast learner under pressure, able to work with agility. With a strong understanding in software development concepts, software design principles, and OOP programming, he defeats programming challenges. Passionate about web and mobile application development, I'm continues to invest my interest and improve my knowledge in the field of technology and programming.",
    "description2": "Celvin Alfino Fernandes is a frontend developer and UI/UX designer passionate about creating intuitive and visually appealing user interfaces. He strives to deliver seamless and engaging user experiences, stays updated with industry trends, and continuously improves his skills to bring innovative solutions to projects.",
    "detail_IL": "The website company profile for Infinite Learning was developed as part of a group project involving five web developers working closely with the UI/UX division. We used JavaScript, leveraging the React.js framework for the frontend and Express.js for the backend, with Tailwind CSS as our styling framework. My role in this project encompassed both frontend and backend development, allowing me to delve deeply into new technologies that I had not previously worked with. Throughout this project, I gained substantial knowledge in using React.js, Express.js, and Tailwind CSS, which significantly expanded my technical skill set. Additionally, this experience sharpened my public speaking abilities and underscored the importance of effective teamwork. A key takeaway from this project was the critical role of thorough research before beginning the implementation phase, which ensured that our solutions were well-informed and effective. The impact of this project extended beyond my personal growth; it also greatly benefited Infinite Learning by enhancing their online presence and providing a professional platform to showcase their services. The successful delivery of this polished and functional website not only elevated the company's brand image but also facilitated better engagement with their target audience, making the project a valuable asset for the organization.",
    "detail_peb" : "During my 6-month internship at PT Epson Batam, I worked on the PEB Recruitment website as a full-stack developer, focusing mainly on frontend development. The project utilized Laravel 10 for the backend and Bootstrap 5 for the frontend, providing me with the opportunity to deepen my expertise in these technologies. This experience was highly impactful, not only for my professional growth but also for the company. I was able to perfect my skills in creating user-friendly interfaces and managing the full development cycle, which significantly contributed to the success of the project. The new recruitment platform streamlined the hiring process, making it more efficient and accessible for both recruiters and applicants. Through this project, I learned the importance of meticulous attention to detail, especially in designing a seamless user experience, and how to effectively balance  frontend and backend responsibilities. This project not only enhanced my technical abilities but also provided valuable insights into the recruitment process within a large organization, making it a critical step in my journey as a developer and delivering tangible benefits to the company.",
    "detail_Tech" : "During my internship at PT. Techno Pilot Indonesia, I worked on developing a company profile website as a full-stack developer. This project was my first experience creating a company profile website, and I was responsible for the entire development process, utilizing Bootstrap 5 for the frontend and CodeIgniter for the backend. The experience was highly educational, providing me with new insights into effectively presenting a company's identity and offerings through a well-crafted website. This project had a significant impact not only on my technical skills—expanding my expertise in web development and deepening my understanding of how to communicate a brand’s value proposition online—but also on the company, as the newly developed website enhanced their online presence and allowed them to better engage with clients and stakeholders. This project marked a crucial milestone in my journey as a web developer, contributing to both my professional growth and the company’s success.",
    "detail_primago" : "The Primago Development website company profile project was a freelance opportunity I secured through a friend who recommended me to a company in need of a new website. The client specifically requested the use of WordPress with the latest Elementor plugin, making this project both a first-time experience with WordPress and my debut as a freelance developer. Despite the tight deadline of just one month, I successfully completed the project on my own, which was both challenging and rewarding. This project had a significant impact, not only on my development as it introduced me to the world of freelance work and provided valuable hands-on experience with WordPress, but also on the company, as the new website significantly improved their online presence and brand image. Through this experience, I learned the importance of time management, client communication, and quickly adapting to new technologies to meet project requirements, all of which contributed to delivering a high-quality product that met the client's expectations.",
    "detail_diyo" : "I worked on a freelance project to create a portfolio website for a businessman named Diyogusti. This project was completed within a tight deadline of one week, using React.js for the development, along with Tailwind CSS and Daisy UI for styling. The quick turnaround time demanded efficient planning and execution, which allowed me to hone my time management skills. The impact of this project was significant; it provided Diyogusti with a professional online presence that effectively showcased his business and personal brand. From this experience, I learned the importance of rapid development while maintaining quality, and it reinforced my ability to work efficiently under pressure. Additionally, this project deepened my understanding of using React.js in conjunction with Tailwind CSS and Daisy UI to create visually appealing and responsive web designs."
}
